tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mongodb/brew"
brew "openssl@3"
brew "bat"
brew "exa"
brew "fd"
brew "fzf"
brew "git"
brew "lazygit"
brew "xz"
brew "luarocks"
brew "mas"
brew "node"
brew "neovim"
brew "openjdk"
brew "pyright"
brew "ripgrep"
brew "sqlite"
brew "starship"
brew "tcl-tk"
brew "trash"
brew "zlib"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "mongodb/brew/mongodb-community"
cask "alacritty"
cask "alfred"
cask "brave-browser"
cask "google-drive"
cask "iterm2"
cask "logi-options-plus"
cask "postman"
cask "pycharm-ce"
cask "rectangle"
cask "visual-studio-code"
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "Prime Video", id: 545519333
mas "SXFI App", id: 1457547274
vscode "albert.TabOut"
vscode "Catppuccin.catppuccin-vsc"
vscode "dsznajder.es7-react-js-snippets"
vscode "EliverLara.andromeda"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "ex-codes.pine-script-syntax-highlighter"
vscode "formulahendry.code-runner"
vscode "golang.go"
vscode "GrapeCity.gc-excelviewer"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "PatrickNasralla.tokyo-night-moon"
vscode "pepri.subtitles-editor"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
