tap "homebrew/bundle"
#tap "homebrew/cask" Untapped on 8th July 2023 as per homebrew's recommendation
tap "homebrew/cask-fonts"
#tap "homebrew/core" Untapped on 8th July 2023 as per homebrew's recommendation

brew "helix"
brew "exa"
brew "bat"
brew "starship"
brew "git"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "python@3.11"
brew "trash"
brew "fzf"
brew "zoxide"

cask "iterm2"
cask "brave-browser"
cask "visual-studio-code"
cask "spotify"
cask "font-jetbrains-mono-nerd-font"
cask "google-drive"